In [1]:
import pandas as pd

In [ ]:
group1_states = ['South Dakota', 'Minnesota', 'North Dakota']
group2_states = ['Louisiana', 'Mississippi', 'Oklahoma']

In [17]:
census_csv = r'C:\Users\vjmar\Desktop\DataScience\blue-team-project-1\csv-data\2022-census.csv'
census_df = pd.read_csv(census_csv)
drop_columns = ['SUMLEV', 'ESTIMATESBASE2020', 'REGION', 'STATE', 'DIVISION']
population_df = census_df[census_df['NAME'].isin(group1_states + group2_states)].drop(columns=drop_columns)
population_df

            NAME  POPESTIMATE2020  POPESTIMATE2021  POPESTIMATE2022
32     Louisiana          4651664          4627098          4590241
37     Minnesota          5709852          5711471          5717184
38   Mississippi          2958141          2949586          2940057
48  North Dakota           779518           777934           779261
50      Oklahoma          3964912          3991225          4019800
55  South Dakota           887799           896164           909824

In [36]:
south_dakota_row = census_df[census_df['NAME'] == 'South Dakota']
minnesota_row = census_df[census_df['NAME'] == 'Minnesota']
north_dakota_row = census_df[census_df['NAME'] == 'North Dakota']

louisiana_row = census_df[census_df['NAME'] == 'Louisiana']
mississippi_row = census_df[census_df['NAME'] == 'Mississippi']
oklahoma_row = census_df[census_df['NAME'] == 'Oklahoma']

south_dakota_average_population = south_dakota_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
south_dakota_pop = round(south_dakota_average_population.values[0])

minnesota_average_population = minnesota_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
minnesota_pop = round(minnesota_average_population.values[0])

north_dakota_average_population = north_dakota_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
north_dakota_pop = round(north_dakota_average_population.values[0])

louisiana_average_population = louisiana_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
lousiana_pop = round(louisiana_average_population.values[0])

mississippi_average_population = mississippi_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
mississippi_pop = round(mississippi_average_population.values[0])

oklahoma_average_population = oklahoma_row[['POPESTIMATE2020', 'POPESTIMATE2021', 'POPESTIMATE2022']].astype(int).mean(axis=1)
oklahoma_pop = round(oklahoma_average_population.values[0])

print("Population for South Dakota:",south_dakota_pop)
print("Population for Minnesota:",minnesota_pop)
print("Population for North Dakota:", north_dakota_pop)
print(" ")

print("Population for Louisiana:", lousiana_pop)
print("Population for Mississippi:", mississippi_pop)
print("Population for Oklahoma:", oklahoma_pop)

Population for South Dakota: 897929
Population for Minnesota: 5712836
Population for North Dakota: 778904

Population for Louisiana: 4623001
Population for Mississippi: 2949261
Population for Oklahoma: 3991979

In [8]:
industries_csv = r'C:\Users\vjmar\Desktop\DataScience\blue-team-project-1\csv-data\industries.csv'

raw_industries_df = pd.read_csv(industries_csv)

state_industries = raw_industries_df[(raw_industries_df['OCC_TITLE'] == 'All Occupations') & (raw_industries_df['I_GROUP'] == 'sector')]

state_industries.head()

,AREA,AREA_TITLE,NAICS_TITLE,I_GROUP,OCC_TITLE,O_GROUP,TOT_EMP
0,1.0,Alabama,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"5,800"
32,2.0,Alaska,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,210
34,4.0,Arizona,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"9,840"
71,5.0,Arkansas,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"4,120"
94,6.0,California,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"239,210"

In [6]:
group1_states = ['South Dakota', 'Minnesota', 'North Dakota']
group1_states_industries = state_industries[state_industries['AREA_TITLE'].isin(group1_states)]
group1_states_industries.head()

,AREA,AREA_TITLE,NAICS_TITLE,I_GROUP,OCC_TITLE,O_GROUP,TOT_EMP
613,27.0,Minnesota,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"3,450"
847,38.0,North Dakota,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,780
1023,46.0,South Dakota,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,720
5131,27.0,Minnesota,"Mining, Quarrying, and Oil and Gas Extraction",sector,All Occupations,total,"5,950"
5533,38.0,North Dakota,"Mining, Quarrying, and Oil and Gas Extraction",sector,All Occupations,total,"15,270"

In [7]:
group2_states = ['Louisiana', 'Mississippi', 'Oklahoma']

# Using isin directly without creating a list
group2_states_industries = state_industries[state_industries['AREA_TITLE'].isin(group2_states)]

# Display the filtered DataFrame
group2_states_industries.head()

,AREA,AREA_TITLE,NAICS_TITLE,I_GROUP,OCC_TITLE,O_GROUP,TOT_EMP
493,22.0,Louisiana,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"3,310"
646,28.0,Mississippi,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"4,420"
887,40.0,Oklahoma,"Agriculture, Forestry, Fishing and Hunting",sector,All Occupations,total,"1,860"
4954,22.0,Louisiana,"Mining, Quarrying, and Oil and Gas Extraction",sector,All Occupations,total,"28,260"
5170,28.0,Mississippi,"Mining, Quarrying, and Oil and Gas Extraction",sector,All Occupations,total,"3,120"